---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainerItem.GetBendData
source: html/0b86dcae-5f5f-5cf4-f5f3-4d8bbf33f27c.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerItem.GetBendData Method

Gets the RebarBendData, containing bar and hook information, of the instance.

## Syntax (C#)
```csharp
public RebarBendData GetBendData()
```

## Remarks
Internally, the bend data is used by many RebarShape methods to generate shape geometry.